In [32]:
import sqlite3
conn = sqlite3.connect('studentdb.db')
c = conn.cursor()

In [2]:
c = conn.cursor()
c.execute('''CREATE TABLE students
          (name text, age integer, height real)''')

In [3]:
c.execute("INSERT INTO students VALUES ('Raj', 20, 5.5)")

In [5]:
all_students = [
    ('Raji', 19, 5.6),
    ('Raj2', 20, 6.5),
    ('Raj3', 21, 5.8),
]

c.executemany('INSERT INTO students VALUES (?,?,?)', all_students)

In [36]:
c.execute('SELECT * FROM students').fetchall()
print( c.execute('SELECT * FROM students').fetchall())

[('Raj', 20, 5.5), ('Raji', 19, 5.6), ('Raj2', 20, 6.5), ('Raj3', 21, 5.8)]

In [29]:
conn.commit()
conn.close()

In [8]:
import pandas as pd
df = pd.read_sql_query("SELECT * FROM students", conn)
df

   name  age  height
0   Raj   20     5.5
1  Raji   19     5.6
2  Raj2   20     6.5
3  Raj3   21     5.8

In [9]:
pd.read_sql_query("SELECT * FROM students WHERE age > 19", conn)

   name  age  height
0   Raj   20     5.5
1  Raj2   20     6.5
2  Raj3   21     5.8

In [13]:
df = pd.read_csv('student.csv')
df

       name  age  height
0     Aisha   19       6
1    Brooke   18       5
2      Otto   27       5
3    Stefan   18       6
4      Myrl   19       6
5     Alvis   27       6
6      Alta   20       5
7       Eva   23       6
8     Lenna   25       6
9     Ruthe   20       6
10    Kadin   21       6
11   Felton   19       6
12   Holden   21       5
13    Leola   26       6
14    Eliza   24       5
15  Viviane   24       6
16    Maxie   18       6
17   Ericka   20       5
18    Rahul   22       6
19   Hilton   26       5
20   Verona   22       6

In [18]:
from sqlalchemy import create_engine
engine = create_engine('sqlite://', echo=False)

In [19]:
df.to_sql('students', con=engine)

21

In [20]:
engine.execute("SELECT * FROM students").fetchall()

[(0, 'Aisha', 19, 6),
 (1, 'Brooke', 18, 5),
 (2, 'Otto', 27, 5),
 (3, 'Stefan', 18, 6),
 (4, 'Myrl', 19, 6),
 (5, 'Alvis', 27, 6),
 (6, 'Alta', 20, 5),
 (7, 'Eva', 23, 6),
 (8, 'Lenna', 25, 6),
 (9, 'Ruthe', 20, 6),
 (10, 'Kadin', 21, 6),
 (11, 'Felton', 19, 6),
 (12, 'Holden', 21, 5),
 (13, 'Leola', 26, 6),
 (14, 'Eliza', 24, 5),
 (15, 'Viviane', 24, 6),
 (16, 'Maxie', 18, 6),
 (17, 'Ericka', 20, 5),
 (18, 'Rahul', 22, 6),
 (19, 'Hilton', 26, 5),
 (20, 'Verona', 22, 6)]

In [22]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///mydb.db', echo=False)
df.to_sql('students', con=engine)

21

In [27]:
c

AttributeError: 'DataFrame' object has no attribute 'read_sql_query'